In [11]:
import pandas as pd 
import sqlite3

In [12]:
# Read the CSV file into a pandas DataFrame
df = pd.read_csv('crimes_against_women_2001_2012.csv')

df.head()

,STATE/UT,DISTRICT,Year,Rape,Kidnapping and Abduction,Dowry Deaths,Assault on women with intent to outrage her modesty,Insult to modesty of Women,Cruelty by Husband or his Relatives,Importation of Girls
0,ANDHRA PRADESH,ADILABAD,2001,50,30,16,149,34,175,0
1,ANDHRA PRADESH,ANANTAPUR,2001,23,30,7,118,24,154,0
2,ANDHRA PRADESH,CHITTOOR,2001,27,34,14,112,83,186,0
3,ANDHRA PRADESH,CUDDAPAH,2001,20,20,17,126,38,57,0
4,ANDHRA PRADESH,EAST GODAVARI,2001,23,26,12,109,58,247,0

In [13]:
# Creating a connection to a SQLite database
conn = sqlite3.connect('crime.db')

# Inserting the DataFrame into a SQLite table
df.to_sql('crimes_women', conn, if_exists='replace', index=False)

9017

# 3.2 Highest number of rapes & kidnapping

In [14]:
query_1 = """
        SELECT [STATE/UT], DISTRICT, Year, MAX(Rape) as MaxRape, MAX([Kidnapping and Abduction]) as MaxKidnapping
        FROM crimes_women
        GROUP BY [STATE/UT], DISTRICT, Year
        ORDER BY MaxRape DESC, MaxKidnapping DESC
        LIMIT 1
        """
result_1 = pd.read_sql_query(query_1, conn)
print(result_1)

         STATE/UT DISTRICT  Year  MaxRape  MaxKidnapping
0  MADHYA PRADESH    TOTAL  2012     3425           1127

# 3.3 Lowest number of rapes and kidnapping

In [15]:
query = """
        SELECT [STATE/UT], DISTRICT, Year, MIN(Rape) as MinRape, MIN([Kidnapping and Abduction]) as MinKidnapping
        FROM crimes_women
        GROUP BY [STATE/UT], DISTRICT, Year
        ORDER BY MinRape ASC, MinKidnapping ASC
        """
result = pd.read_sql_query(query, conn)
print(result)

            STATE/UT DISTRICT  Year  MinRape  MinKidnapping
0      A & N ISLANDS  NICOBAR  2001        0              0
1      A & N ISLANDS  NICOBAR  2003        0              0
2      A & N ISLANDS  NICOBAR  2004        0              0
3      A & N ISLANDS  NICOBAR  2005        0              0
4      A & N ISLANDS  NICOBAR  2006        0              0
...              ...      ...   ...      ...            ...
9011  MADHYA PRADESH    TOTAL  2009     2998            841
9012  MADHYA PRADESH    TOTAL  2007     3010            701
9013  MADHYA PRADESH    TOTAL  2010     3135           1030
9014  MADHYA PRADESH    TOTAL  2011     3406           1088
9015  MADHYA PRADESH    TOTAL  2012     3425           1127

[9016 rows x 5 columns]

# 3.4 Insert crimes against ST data

In [16]:
df_1 = pd.read_csv('crime_against_ST_2001_2012.csv')

df_1.head()

,STATE/UT,DISTRICT,Year,Murder,Rape,Kidnapping Abduction,Dacoity,Robbery,Arson,Hurt,Protection of Civil Rights (PCR) Act,Prevention of atrocities (POA) Act,Other Crimes Against STs
0,ANDHRA PRADESH,ADILABAD,2001,0,1,2,0,0,0,2,0,0,13
1,ANDHRA PRADESH,ANANTAPUR,2001,0,0,0,0,0,0,7,0,1,6
2,ANDHRA PRADESH,CHITTOOR,2001,0,0,0,0,0,0,2,0,0,0
3,ANDHRA PRADESH,CUDDAPAH,2001,0,0,0,0,0,0,2,0,2,0
4,ANDHRA PRADESH,EAST GODAVARI,2001,0,0,0,0,0,0,0,0,0,14

In [17]:
#conn = sqlite3.connect('crimes.db')

df_1.to_sql('crimes_district', conn, if_exists='replace', index=False)

9018

# 3.5 Highest number of dacoity/robbery in which district

In [18]:
query1 ='''SELECT DISTRICT, MAX(Dacoity + Robbery) AS "[Highest Dacoity/Robbery]"
               FROM crimes_district
               GROUP BY DISTRICT
               ORDER BY "[Highest Dacoity/Robbery]" DESC
               LIMIT 1'''

result = pd.read_sql_query(query1, conn)
print(result)

  DISTRICT  [Highest Dacoity/Robbery]
0    TOTAL                         63

# 3.6 The lowest number of murders happened in which districts(All)

In [19]:
query2 ='''SELECT DISTRICT, MIN(Murder) AS "[Lowest Murders]"
FROM crimes_district
GROUP BY DISTRICT
ORDER BY "[Lowest Murders]" ASC'''

result = pd.read_sql_query(query2, conn)
print(result)

              DISTRICT  [Lowest Murders]
0    24 PARGANAS NORTH                 0
1    24 PARGANAS SOUTH                 0
2      A and N ISLANDS                 0
3             ADILABAD                 0
4                 AGRA                 0
..                 ...               ...
808        YAMUNANAGAR                 0
809           YAVATMAL                 0
810          ZUNHEBOTO                 0
811          KONDAGAON                 1
812            MUNGELI                 1

[813 rows x 2 columns]

# 3.7 The number of murders in ascending order in district and yearwise

In [20]:
query3 = '''
SELECT DISTRICT, Year, Murder
FROM crimes_district
ORDER BY DISTRICT ASC, Year ASC, Murder ASC'''

result = pd.read_sql_query(query3, conn)
print(result)

               DISTRICT  Year  Murder
0     24 PARGANAS NORTH  2001       0
1     24 PARGANAS NORTH  2002       0
2     24 PARGANAS NORTH  2003       0
3     24 PARGANAS NORTH  2004       0
4     24 PARGANAS NORTH  2005       0
...                 ...   ...     ...
9013          ZUNHEBOTO  2008       0
9014          ZUNHEBOTO  2009       0
9015          ZUNHEBOTO  2010       0
9016          ZUNHEBOTO  2011       0
9017          ZUNHEBOTO  2012       0

[9018 rows x 3 columns]

# 3.8.1 Insert record IPC_2001_2012

In [21]:
df_2 = pd.read_csv('IPC_2001_2012.csv')

df_2.head()

,STATE/UT,DISTRICT,YEAR,MURDER,ATTEMPT TO MURDER,CULPABLE HOMICIDE NOT AMOUNTING TO MURDER,RAPE,CUSTODIAL RAPE,OTHER RAPE,KIDNAPPING & ABDUCTION,...,ARSON,HURT/GREVIOUS HURT,DOWRY DEATHS,ASSAULT ON WOMEN WITH INTENT TO OUTRAGE HER MODESTY,INSULT TO MODESTY OF WOMEN,CRUELTY BY HUSBAND OR HIS RELATIVES,IMPORTATION OF GIRLS FROM FOREIGN COUNTRIES,CAUSING DEATH BY NEGLIGENCE,OTHER IPC CRIMES,TOTAL IPC CRIMES
0,ANDHRA PRADESH,ADILABAD,2001,101,60,17,50,0,50,46,...,30,1131,16,149,34,175,0,181,1518,4154
1,ANDHRA PRADESH,ANANTAPUR,2001,151,125,1,23,0,23,53,...,69,1543,7,118,24,154,0,270,754,4125
2,ANDHRA PRADESH,CHITTOOR,2001,101,57,2,27,0,27,59,...,38,2088,14,112,83,186,0,404,1262,5818
3,ANDHRA PRADESH,CUDDAPAH,2001,80,53,1,20,0,20,25,...,23,795,17,126,38,57,0,233,1181,3140
4,ANDHRA PRADESH,EAST GODAVARI,2001,82,67,1,23,0,23,49,...,41,1244,12,109,58,247,0,431,2313,6507

In [22]:
df_2.to_sql('crimes_district_IPC', conn, if_exists='replace', index=False)

9017

# 3.8.2 which District in each state/ut has the highest number of murders yearwise. Your output should show STATE/UT, YEAR, DISTRICT, and MURDERS.

In [23]:
query1 = '''SELECT [STATE/UT], YEAR, DISTRICT, MAX(MURDER) AS MURDERS
FROM crimes_district_IPC
GROUP BY [STATE/UT], YEAR
ORDER BY [STATE/UT], YEAR '''

result = pd.read_sql_query(query1, conn)
print(result)

          STATE/UT  YEAR DISTRICT  MURDERS
0    A & N ISLANDS  2001  ANDAMAN       13
1    A & N ISLANDS  2002    TOTAL       17
2    A & N ISLANDS  2003    TOTAL       21
3    A & N ISLANDS  2004    TOTAL       15
4    A & N ISLANDS  2005  ANDAMAN       14
..             ...   ...      ...      ...
415    WEST BENGAL  2008    TOTAL     1811
416    WEST BENGAL  2009    TOTAL     2068
417    WEST BENGAL  2010    TOTAL     2398
418    WEST BENGAL  2011    TOTAL     2109
419    WEST BENGAL  2012    TOTAL     2252

[420 rows x 4 columns]